# Pyber Challenge

### 4.3 Loading and Reading CSV files

In [126]:
# Add Matplotlib inline magic command
%matplotlib inline
# Dependencies and Setup
import matplotlib.pyplot as plt
import pandas as pd

# File to Load (Remember to change these)
city_data_to_load = "Resources/city_data.csv"
ride_data_to_load = "Resources/ride_data.csv"

# Read the City and Ride Data
city_data_df = pd.read_csv(city_data_to_load)
ride_data_df = pd.read_csv(ride_data_to_load)

### Merge the DataFrames

In [127]:
# Combine the data into a single dataset
pyber_data_df = pd.merge(ride_data_df, city_data_df, how="left", on=["city", "city"])

# Display the data table for preview
pyber_data_df.head()

,city,date,fare,ride_id,driver_count,type
0,Lake Jonathanshire,1/14/2019 10:14,13.83,5739410000000,5,Urban
1,South Michelleport,3/4/2019 18:24,30.24,2343910000000,72,Urban
2,Port Samanthamouth,2/24/2019 4:29,33.44,2005070000000,57,Urban
3,Rodneyfort,2/10/2019 23:22,23.44,5149250000000,34,Urban
4,South Jack,3/6/2019 4:28,34.58,3908450000000,46,Urban

## Deliverable 1: Get a Summary DataFrame

In [128]:
#  1. Get the total rides for each city type
rides_per_city = pyber_data_df.groupby(["type"]).count()["ride_id"]
rides_per_city

type
Rural        125
Suburban     625
Urban       1625
Name: ride_id, dtype: int64

In [129]:
# 2. Get the total drivers for each city type
drivers_per_city = city_data_df.groupby(["type"]).sum()["driver_count"]
drivers_per_city

type
Rural         78
Suburban     490
Urban       2405
Name: driver_count, dtype: int64

In [130]:
#  3. Get the total amount of fares for each city type
fare_per_city = pyber_data_df.groupby(["type"]).sum()["fare"]
fare_per_city

type
Rural        4327.93
Suburban    19356.33
Urban       39854.38
Name: fare, dtype: float64

In [131]:
#  4. Get the average fare per ride for each city type. 
fare_per_ride_type = fare_per_city / rides_per_city
fare_per_ride_type

type
Rural       34.623440
Suburban    30.970128
Urban       24.525772
dtype: float64

In [132]:
# 5. Get the average fare per driver for each city type. 
fare_per_driver_type = fare_per_city / drivers_per_city
fare_per_driver_type

type
Rural       55.486282
Suburban    39.502714
Urban       16.571468
dtype: float64

In [133]:
#  6. Create a PyBer summary DataFrame.
pyber_summary_df = pd.DataFrame(
   {"Total Rides": rides_per_city,
     "Total Drivers": drivers_per_city,
     "Total Fares": fare_per_city,
     "Average Fare per Ride": fare_per_ride_type,
     "Average Fare per Driver": fare_per_driver_type})
pyber_summary_df

,Total Rides,Total Drivers,Total Fares,Average Fare per Ride,Average Fare per Driver
type,,,,,
Rural,125,78,4327.93,34.623440,55.486282
Suburban,625,490,19356.33,30.970128,39.502714
Urban,1625,2405,39854.38,24.525772,16.571468

In [134]:
#  7. Cleaning up the DataFrame. Delete the index name
pyber_summary_df.index.name = None

In [135]:
#  8. Format the columns.
# add comma
pyber_summary_df["Total Rides"] = pyber_summary_df["Total Rides"].map("{:,}".format)
pyber_summary_df["Total Drivers"] = pyber_summary_df["Total Drivers"].map("{:,}".format)
# add $ and comma
pyber_summary_df["Total Fares"] = pyber_summary_df["Total Fares"].map("${:,.2f}".format)
# add $ and two decimal places
pyber_summary_df["Average Fare per Ride"] = pyber_summary_df["Average Fare per Ride"].map("${:.2f}".format)
pyber_summary_df["Average Fare per Driver"] = pyber_summary_df["Average Fare per Driver"].map("${:.2f}".format)
pyber_summary_df

,Total Rides,Total Drivers,Total Fares,Average Fare per Ride,Average Fare per Driver
Rural,125,78,"$4,327.93",$34.62,$55.49
Suburban,625,490,"$19,356.33",$30.97,$39.50
Urban,"1,625","2,405","$39,854.38",$24.53,$16.57

## Deliverable 2.  Create a multiple line plot that shows the total weekly of the fares for each type of city.

In [136]:
# DEBUG????  IGNORE????






# 1. Read the merged DataFrame

In [138]:
# 2. Using groupby() to create a new DataFrame showing the sum of the fares 
#  for each date where the indices are the city type and date.
fare_summary_df = pyber_data_df.groupby(["date","type"]).sum()[["fare"]]
fare_summary_df

                          fare
date           type
1/1/2019 0:08  Urban     37.91
1/1/2019 0:46  Suburban  47.74
1/1/2019 12:32 Suburban  25.56
1/1/2019 14:40 Urban      5.42
1/1/2019 14:42 Urban     12.31
...                        ...
5/8/2019 1:54  Urban     32.69
5/8/2019 2:31  Urban     41.33
5/8/2019 4:20  Urban     21.99
5/8/2019 4:39  Urban     18.45
5/8/2019 7:29  Urban     18.55

[2364 rows x 1 columns]

In [139]:
# 3. Reset the index on the DataFrame you created in #1. This is needed to use the 'pivot()' function.
# df = df.reset_index()
fare_summary_df = fare_summary_df.reset_index()
fare_summary_df

                date      type   fare
0      1/1/2019 0:08     Urban  37.91
1      1/1/2019 0:46  Suburban  47.74
2     1/1/2019 12:32  Suburban  25.56
3     1/1/2019 14:40     Urban   5.42
4     1/1/2019 14:42     Urban  12.31
...              ...       ...    ...
2359   5/8/2019 1:54     Urban  32.69
2360   5/8/2019 2:31     Urban  41.33
2361   5/8/2019 4:20     Urban  21.99
2362   5/8/2019 4:39     Urban  18.45
2363   5/8/2019 7:29     Urban  18.55

[2364 rows x 3 columns]

In [141]:
# 4. Create a pivot table with the 'date' as the index, the columns ='type', and values='fare' 
# to get the total fares for each type of city by the date. 
fare_summary_df_pivot = fare_summary_df.pivot(index="date", columns="type", values="fare")
fare_summary_df_pivot

type            Rural  Suburban  Urban
date
1/1/2019 0:08     NaN       NaN  37.91
1/1/2019 0:46     NaN     47.74    NaN
1/1/2019 12:32    NaN     25.56    NaN
1/1/2019 14:40    NaN       NaN   5.42
1/1/2019 14:42    NaN       NaN  12.31
...               ...       ...    ...
5/8/2019 1:54     NaN       NaN  32.69
5/8/2019 2:31     NaN       NaN  41.33
5/8/2019 4:20     NaN       NaN  21.99
5/8/2019 4:39     NaN       NaN  18.45
5/8/2019 7:29     NaN       NaN  18.55

[2361 rows x 3 columns]

In [15]:
# 5. Create a new DataFrame from the pivot table DataFrame using loc on the given dates, '2019-01-01':'2019-04-29'.

In [16]:
# 6. Set the "date" index to datetime datatype. This is necessary to use the resample() method in Step 8.
# df.index = pd.to_datetime(df.index)

In [17]:
# 7. Check that the datatype for the index is datetime using df.info()

In [18]:
# 8. Create a new DataFrame using the "resample()" function by week 'W' and get the sum of the fares for each week.

In [19]:
# 8. Using the object-oriented interface method, plot the resample DataFrame using the df.plot() function. 

# Import the style from Matplotlib.
from matplotlib import style
# Use the graph style fivethirtyeight.
style.use('fivethirtyeight')